import pandas as pd

df_wes = pd.read_excel(r"E:\powerbi_data\看板数据\私有云文件本地\收集文件\2026年WES返利汇总表.xlsx", sheet_name='两网')[["公司名称", "2025年1月得分", "2025年2月得分", "2025年3月得分", "2025年4月得分", "2025年5月得分", "2025年6月得分", "2025年7月得分", "2025年8月得分", "2025年9月得分", "2025年10月得分", "2025年11月得分", "2025年12月得分", "2025年1月折让", "2025年2月折让", "2025年3月折让", "2025年4月折让", "2025年5月折让", "2025年6月折让", "2025年7月折让", "2025年8月折让", "2025年9月折让", "2025年10月折让", "2025年11月折让", "2025年12月折让"]]
df_wes = df_wes.replace({"文景初治":"上元盛世", "永乐盛世":"洪武盛世"})
df_wes = df_wes.drop_duplicates(subset=['公司名称'], keep='last')
df_wes.to_csv("df_wes.csv")
print(df_wes)































